//JOER$ JOB 'ADCD V2R9','SYSPROG',NOTIFY=&SYSUID,REGION=0M
//TESTEST  EXEC PGM=CESTAE
//STEPLIB  DD  DSN=JOER.TEST.AUTHLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//
